app/views/relationships/index.html.erb

          <td>
            <%= relationship.leader.leading_relationships.count %>
---
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."leader_id" = $1  [["leader_id", 2]]