app/views/users/show.html.erb

SELECT "pubs".* FROM "pubs" WHERE "pubs"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "pubs" WHERE "pubs"."user_id" = $1  [["user_id", 1]]
---
  <li class='<%= 'active' if params[:tab].nil? %>'>
    <%= link_to "Pubs (#{@user.pubs.size})", user_path(@user) %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 1]]
---
  <li class='<%= 'active' if params[:tab] == 'reviews' %>'>
    <%= link_to "Reviews (#{@user.reviews.size})", user_path(@user, tab: 'reviews') %>