app/controllers/pubs_controller.rb

SELECT "pubs".* FROM "pubs"
---
  def index
    @pubs = Pub.all

INSERT INTO "pubs" ("title", "url", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "title1"], ["url", "www.title.com"], ["content", "abstract"], ["created_at", "2016-02-15 20:43:31.928326"], ["updated_at", "2016-02-15 20:43:31.928326"]]
---
  def create
    @pub = Pub.new(params.require(:pub).permit(:title, :url, :content))
    @pub.user = current_user
    if @pub.save

SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @pub = Pub.find(params[:id])