app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "relationships" ("leader_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["leader_id", 1], ["follower_id", 2], ["created_at", "2016-02-22 08:18:21.017866"], ["updated_at", "2016-02-22 08:18:21.017866"]]
---
  def create
    leader = User.find(params[:leader_id])
    Relationship.create(leader_id: params[:leader_id], follower: current_user) unless current_user.already_follows?(leader) || current_user == leader