app/controllers/reviews_controller.rb

  def create
    @pub = Pub.find(params[:pub_id])
    @review = @pub.reviews.new(params.require(:review).permit(:body).merge!(user: current_user))
    if @review.save
---
SELECT  "pubs".* FROM "pubs" WHERE "pubs"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("user_id", "pub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 134], ["pub_id", 160], ["created_at", "2016-02-15 22:48:11.675324"], ["updated_at", "2016-02-15 22:48:11.675324"]]