app/controllers/sessions_controller.rb

  def create
    user = User.find_by(full_name: params[:full_name])
---
SELECT  "users".* FROM "users" WHERE "users"."full_name" = $1 LIMIT 1  [["full_name", "f"]]