app/views/pubs/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."pub_id" = $1  [["pub_id", 1]]
---

<% @pub.reviews.each do |review| %>